<template>
  <div class="backgroud">
    <van-nav-bar title="选择城市" left-arrow @click-left="onClickLeft"></van-nav-bar>
    <!-- <form action="/">
      <van-search v-model="value" show-action placeholder="请输入搜索关键词" @search="onSearch" @cancel="onCancel" />
    </form> -->
    <div class="city-block">
      <div class="cityList">
        <van-collapse v-for="(value,key,index) in city" :key="key" v-model="activeName" class="province" accordion>
          <van-collapse-item :title="key" :name="index">
            <van-cell @click="selectcity(item)" v-for="item in value" :key="item" :title="item"></van-cell>
          </van-collapse-item>
        </van-collapse>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      value: '',
      activeName: ["1"],
      history: [],
      hotcity: ['杭州', '青岛', '哈尔滨', '北京', '上海', '武汉', '深圳', '广州'],
      city: {
        直辖市: ["北京", "上海", "重庆", "天津"],
        黑龙江: ["哈尔滨", "大庆", "齐齐哈尔", "佳木斯", "鸡西", "鹤岗", "双鸭山", "牡丹江", "伊春", "七台河", "黑河", "绥化", "五常", "双城", "尚志纳河", "虎林", "密山", "铁力", "同江", "富锦", "绥芬河", "海林", "宁安", "穆林", "北安", "五大连池", "肇东", "海伦", "安达"],
        吉林: ["长春", "吉林", "四平", "辽源", "通化", "白山松原", "白城", "九台", "榆树", "德惠", "舒兰", "桦甸", "蛟河", "磐石", "公主岭", "双辽", "梅河口", "集安", "临江", "大安", "洮南", "延吉", "图们", "敦化", "龙井", "珲春", "和龙"],
        辽宁: ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛", "新民", "瓦房店", "普兰", "庄河", "海城", "东港", "凤城", "凌海", "北镇", "大石桥", "盖州", "灯塔", "调兵山", "开原", "凌源", "北票", "兴城"],
        内蒙古: ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "乌兰察布", "巴彦淖尔", "阿拉善盟", "锡林郭勒", "兴安"],
        河南: ["郑州", "洛阳", "开封", "漯河", "安阳", "新乡", "周口", "三门峡", "焦作", "平顶山", "信阳", "南阳", "鹤壁", "濮阳", "许昌", "商丘", "驻马店", "巩义", "新郑", "新密", "登封", "荥阳", "偃师", "汝州", "舞钢", "林州", "卫辉", "辉县", "沁阳", "孟州", "禹州", "长葛", "义马", "灵宝", "邓州", "永城", "项城", "济源"],
        河北: ["石家庄", "唐山", "邯郸", "秦皇岛", "保定", "张家口", "承德", "廊坊", "沧州", "衡水", "邢台", "辛集", "藁城", "晋州", "新乐", "鹿泉", "遵化", "迁安", "武安", "南宫", "沙河", "涿州", "定州", "安国", "高碑店", "泊头", "任丘", "黄骅", "河间", "霸州", "三河", "冀州", "深州"],
        山东: ["济南", "青岛", "淄博枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "德州", "聊城", "菏泽", "滨州", "章丘", "胶南", "胶州", "平度", "莱西", "即墨", "滕州", "龙口", "莱阳", "莱州", "招远", "蓬莱", "栖霞", "海阳", "青州", "诸城", "安丘", "高密", "昌邑", "兖州", "曲阜", "邹城", "乳山", "文登", "荣成", "乐陵", "临清", "禹城"],
        山西: ["太原", "大同", "忻州", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "临汾", "吕梁", "古交", "潞城", "高平", "介休", "永济", "河津", "原平", "侯马", "霍州", "孝义", "汾阳"],
        陕西: ["西安", "咸阳", "铜川", "延安宝鸡", "渭南", "汉中", "安康", "商洛", "榆林", "兴平", "韩城", "华阴"],
        江苏: ["南京镇江", "常州", "无锡", "苏州", "徐州", "连云港", "淮安", "盐城", "扬州", "泰州", "南通", "宿迁", "江阴", "宜兴", "邳州", "新沂", "金坛", "溧阳", "常熟", "张家港", "太仓", "昆山", "吴江", "如皋", "通州", "海门", "启东", "东台", "大丰", "高邮", "江都", "仪征", "丹阳", "扬中", "句容", "泰兴", "姜堰", "靖江", "兴化"],
        江西: ["南昌", "九江", "赣州", "吉安", "鹰潭", "上饶", "萍乡", "景德镇", "新余", "宜春", "抚州", "乐平", "瑞昌", "贵溪", "瑞金", "南康", "井冈山", "丰城", "樟树", "高安", "德兴"],
        安徽: ["合肥", "蚌埠", "芜湖", "淮南", "亳州", "阜阳", "淮北", "宿州", "滁州", "安庆", "巢湖", "马鞍山", "宣城", "黄山", "池州", "铜陵", "界首", "天长", "明光", "桐城", "宁国"],
        浙江: ["杭州", "嘉兴", "湖州", "宁波", "金华", "温州", "丽水", "绍兴", "衢州", "舟山", "台州", "建德", "富阳", "临安", "余姚", "慈溪", "奉化", "瑞安", "乐清", "海宁", "平湖", "桐乡", "诸暨", "上虞", "嵊州", "兰溪", "义乌", "东阳", "永康", "江山", "临海", "温岭", "龙泉"],
        湖南: ["长沙", "株洲", "湘潭", "衡阳", "岳阳", "郴州", "永州", "邵阳", "怀化", "常德", "益阳", "张家界", "娄底", "浏阳", "醴陵", "湘乡", "韶山", "耒阳", "常宁", "武冈", "临湘", "汨罗", "津市", "沅江", "资兴", "洪江", "冷水江", "涟源", "吉首"],
        湖北: ["武汉", "黄石", "襄阳", "十堰", "荆州", "宜昌", "荆门", "鄂州", "孝感", "黄冈", "咸宁", "随州", "恩施", "仙桃", "潜江", "天门", "神农架"],
        福建: ["福州", "厦门", "泉州", "三明", "南平", "漳州", "莆田", "宁德", "龙岩", "福清", "长乐", "永安", "石狮", "晋江", "南安", "龙海", "邵武", "武夷山", "建瓯", "建阳", "漳平", "福安", "福鼎"],
        广东: ["广州", "深圳", "汕头", "惠州", "珠海", "揭阳", "佛山", "河源", "阳江", "茂名", "湛江", "梅州", "肇庆", "韶关", "潮州", "东莞", "中山", "清远", "江门", "汕尾", "云浮", "增城", "从化", "乐昌", "南雄", "台山", "开平", "鹤山", "恩平", "廉江", "雷州", "吴川", "高州", "化州", "高要", "四会", "兴宁", "陆丰", "阳春", "英德", "连州", "普宁", "罗定"],
        广西: ["南宁", "柳州", "桂林", "梧州", "北海", "崇左", "来宾", "贺州", "玉林", "百色", "河池", "钦州", "防城港", "贵港", "岑溪", "凭祥", "合山", "北流", "宜州", "东兴", "桂平"],
        云南: ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "安宁", "宣威", "个旧", "开远", "景洪", "楚雄", "大理", "潞西", "瑞丽"],
        贵州: ["贵阳", "六盘水", "遵义", "安顺", "清镇", "赤水", "仁怀", "铜仁", "毕节", "兴义", "凯里", "都匀", "福泉"],
        四川: ["成都", "绵阳", "德阳", "广元", "自贡", "攀枝花", "乐山", "南充", "内江", "遂宁", "广安", "泸州", "达州", "眉山", "宜宾", "雅安", "资阳", "都江堰", "彭州", "邛崃", "崇州", "广汉", "什邡", "绵竹", "江油", "峨眉山", "阆中", "华蓥", "万源", "简阳", "西昌"],
        甘肃: ["兰州", "天水", "平凉", "酒泉", "嘉峪关", "金昌", "白银", "武威", "张掖", "庆阳", "定西", "陇南", "玉门", "敦煌", "临夏", "合作"],
        宁夏: ["银川", "石嘴山", "吴忠", "固原", "中卫"],
        西藏: ["拉萨", "日喀则", "昌都", "林芝", "山南"],
        新疆: ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密"],
        海南: ["海口", "三亚", "琼海", "文昌", "万宁", "五指山", "儋州", "东方"],
      }
    }
  },
  methods: {
    onClickLeft() {
      this.$router.go(-1);
    },
    onSearch(val) {
      this.$toast(val);
    },
    onCancel() {
      this.$toast('取消');
    },
    selectcity(value) {
      var name = this.$route.params.city;
      sessionStorage.setItem(name, value);
      this.$router.push({
        name: 'index'
      })
    }
  }
}
</script>

<style lang="less" scoped>
.backgroud {
  background-color: #F7F8FA;
  height: 667px;
  overflow: hidden;
}

.city-block {
  height: 621px;
  overflow: scroll;
}

/deep/.van-nav-bar {
  color: #fff;
  background-color: #2AB3EF;

  .van-icon {
    color: #fff;
  }

  .van-nav-bar__title {
    color: #fff;
  }
}

/deep/.van-grid-item__text {
  font-size: 16px;
}

/deep/.van-nav-bar /deep/.van-icon {
  color: #f4f4f4;
}
</style>
